000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. HELLO.
000030*
000040 ENVIRONMENT DIVISION.
000041 INPUT-OUTPUT SECTION.
000042 FILE-CONTROL.
000043    SELECT IN-FILE
000044         ASSIGN TO DISK
000045         ORGANIZATION IS LINE SEQUENTIAL.
000050*
000060 DATA DIVISION.
000061 FILE SECTION.
000062 FD IN-FILE
000063       LABEL RECORDS ARE STANDARD
000064       VALUE OF FILE-ID IS "input.txt".
000065     01 THE-FILE.
000066        03 FST-NUM PIC 9.
000067        03 NOTHING PIC X.
000068        03 SND-NUM PIC 9.
000067*
000070 WORKING-STORAGE SECTION.
000071 01 TEXT-OUT PIC X(12) VALUE 'Hello World!'.
000072*
000080*
000090*
000180 PROCEDURE DIVISION.
000190 MAIN-PARAGRAPH.
000200     OPEN INPUT IN-FILE.
000201     READ IN-FILE.
000201     DISPLAY FST-NUM.
000202     READ IN-FILE.
000203     DISPLAY FST-NUM.
000204     DISPLAY SND-NUM.
000209     CLOSE IN-FILE.
000210     DISPLAY TEXT-OUT.
000211     STOP RUN.
