000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. HELLO.
000030*
000040 ENVIRONMENT DIVISION.
000041 INPUT-OUTPUT SECTION.
000042 FILE-CONTROL.
000043    SELECT IN-FILE
000044         ASSIGN TO DISK
000045         ORGANIZATION IS LINE SEQUENTIAL.
000050*
000060 DATA DIVISION.
000061 FILE SECTION.
000062 FD IN-FILE
000063       LABEL RECORDS ARE STANDARD
000064       VALUE OF FILE-ID IS "input.txt".
000065     01 THE-FILE.
000066        03 FST-NUM PIC 99.
000067        03 NOTHING PIC X.
000068        03 SND-NUM PIC 99.
000067*
000070 WORKING-STORAGE SECTION.
000071 01 GRAPH-TABLE.
000072    03 THE-ROW  OCCURS 23.
000073      05 THE-CELL  PIC X OCCURS 79.
000074 01 POINT-COUNT PIC 9(2)  VALUE 0.
000075 01 X1          PIC 9(2)  VALUE 0.
000076 01 Y1          PIC 9(2)  VALUE 0.
000077 01 X2          PIC 9(2)  VALUE 0.
000078 01 Y2          PIC 9(2)  VALUE 0.
000080*
000081 01 VAR-I       PIC 9(2)  VALUE 0.
000082 01 VAR-J       PIC 9(2)  VALUE 0.
000090*
000180 PROCEDURE DIVISION.
000190 MAIN-PARAGRAPH.
000200     OPEN INPUT IN-FILE.
000201     READ IN-FILE.
000201     DISPLAY FST-NUM.
000202     READ IN-FILE.
000203     DISPLAY FST-NUM.
000204     DISPLAY SND-NUM.
000205     READ IN-FILE.
000206     DISPLAY FST-NUM.
000207     DISPLAY SND-NUM.
000209     CLOSE IN-FILE.
000703     GO TO FILL-EMPTY-GRAPH.
000704 FILL-EMPTY-GRAPH-EXIT.
000705     MOVE "A" TO THE-CELL(5, 5).
000706     MOVE "z" TO THE-CELL(15, 20).
000800     GO TO SHOW-GRAPH.
000801 SHOW-GRAPH-EXIT.
090000     STOP RUN.
100000*
100010 FILL-EMPTY-GRAPH.
100011     MOVE 1 TO VAR-I.
100012     MOVE 1 TO VAR-J
100014     GO TO FILL-CELL-LOOP.
100015 FILL-CELL-LOOP-EXIT.
100016     GO TO FILL-X-AXIS.
100017 FILL-X-AXIS-EXIT.
100018     GO TO FILL-Y-AXIS.
100019 FILL-Y-AXIS-EXIT.
100020     GO TO FILL-EMPTY-GRAPH-EXIT.
100099*
100100 FILL-CELL-LOOP.
100101     MOVE "*" TO THE-CELL(VAR-J, VAR-I).
100103     ADD 1 TO VAR-I.
100104     IF VAR-I = 80
100105         MOVE 1 TO VAR-I.
100106     IF VAR-I = 1
100107         ADD 1 TO VAR-J.
100108     IF VAR-J < 24
100109         GO TO FILL-CELL-LOOP.
100110     GO TO FILL-CELL-LOOP-EXIT.
100200
100201 FILL-X-AXIS.
100202     MOVE 1 TO VAR-I.
100203     GO TO FILL-X-AXIS-LOOP.
100204 FILL-X-AXIS-LOOP-EXIT.
100205     GO TO FILL-X-AXIS-EXIT.
100206 FILL-X-AXIS-LOOP.
100207     MOVE "-" TO THE-CELL(1, VAR-I).
100208     ADD 1 TO VAR-I.
100209     IF VAR-I < 80 GO TO FILL-X-AXIS-LOOP.
100210     GO TO FILL-X-AXIS-LOOP-EXIT.
100300*
100301 FILL-Y-AXIS.
100302     MOVE 1 TO VAR-I.
100303     GO TO FILL-Y-AXIS-LOOP.
100304 FILL-Y-AXIS-LOOP-EXIT.
100305     GO TO FILL-Y-AXIS-EXIT.
100306 FILL-Y-AXIS-LOOP.
100307     MOVE "|" TO THE-CELL(VAR-I, 1).
100308     ADD 1 TO VAR-I.
100309     IF VAR-I < 24 GO TO FILL-Y-AXIS-LOOP.
100310     GO TO FILL-Y-AXIS-LOOP-EXIT.
100900
100901 SHOW-GRAPH.
100902     MOVE 23 TO VAR-I.
100903     GO TO SHOW-GRAPH-LOOP.
100904 SHOW-GRAPH-LOOP-EXIT.
100905     GO TO SHOW-GRAPH-EXIT.
100906
100907 SHOW-GRAPH-LOOP.
100908     DISPLAY THE-ROW(VAR-I).
100909     SUBTRACT 1 FROM VAR-I.
100910     IF VAR-I = 0
100911         GO TO SHOW-GRAPH-LOOP-EXIT.
100912     GO TO SHOW-GRAPH-LOOP.